In [26]:
import pandas as pd
import numpy as np

In [27]:
df=pd.read_csv('Bengaluru_House_Data.csv')
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [28]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [29]:
for col in df.columns:
    print(df[col].value_counts())
    print('****************************')

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
****************************
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
14-Nov               1
16-Jan               1
16-Nov               1
15-Aug               1
15-Dec               1
Name: availability, Length: 81, dtype: int64
****************************
Whitefield                 540
Sarjapur  Road             399
Electronic City            302
Kanakpura Road             273
Thanisandra                234
                          ...
Keerthi Layout               1
Sahyadri Layout              1
Banashankari 2 nd Stage      1
Kalkere Channasandra         1
Venkateswara Nagar           1
Name: location, Length: 1305, dtype: int64
****************************
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
10 BHK           2
11 Bedroom       2
11 BHK           2
19 BHK           1
12 Bedroom       1
43 Bedroom       1
18 Bedroom       1
14 BHK           1
16 BHK           1
13 BHK           1
27 BHK           1
Name: size, dtype: int64
****************************
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
SLhidOr     1
BMoldar     1
Chuti S     1
K tlete     1
Ranorar     1
Name: society, Length: 2688, dtype: int64
****************************
1200         843
1100         221
1500         205
2400         196
600          180
            ...
3073           1
650 - 760      1
300            1
1922           1
3175           1
Name: total_sqft, Length: 2117, dtype: int64
****************************
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
11.0       3
13.0       3
16.0       2
14.0       1
40.0       1
18.0       1
27.0       1
15.0       1
Name: bath, dtype: int64
****************************
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
****************************
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
45.69       1
85.41       1
91.31       1
102.92      1
62.28       1
Name: price, Length: 1994, dtype: int64
****************************

In [30]:
df.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

In [31]:
df=df[['location','size','total_sqft', 'bath','price']]
df.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [32]:
df.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [33]:
df['location']=df['location'].fillna('Sarjapur  Road')

In [34]:
df['size']=df['size'].fillna('2 BHK')

In [35]:
df['bath']=df['bath'].fillna(df['bath'].median())

In [36]:
df.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [37]:
df['size'].value_counts()

2 BHK         5215
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
10 BHK           2
11 Bedroom       2
11 BHK           2
19 BHK           1
12 Bedroom       1
43 Bedroom       1
18 Bedroom       1
14 BHK           1
16 BHK           1
13 BHK           1
27 BHK           1
Name: size, dtype: int64

In [38]:
df['bhk']=df['size'].str.split().str.get(0).astype(int)

In [39]:
df.head()

                   location       size total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [40]:
df['bhk'].value_counts()

2     5544
3     4857
4     1417
1      656
5      356
6      221
7      100
8       89
9       54
10      14
11       4
16       1
27       1
43       1
18       1
12       1
13       1
14       1
19       1
Name: bhk, dtype: int64

In [41]:
df['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [42]:
def convertrange(x):
    temp=x.split('_')
    if len(temp)==2:
        return(float(temp[0])+float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [43]:
df['total_sqft']=df['total_sqft'].apply(convertrange)

In [44]:
df.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [45]:
# price per sq.ft
df['price_per_sqft']=df['price']*100000/df['total_sqft']
df.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [46]:
df['location'].value_counts()

Whitefield                 540
Sarjapur  Road             400
Electronic City            302
Kanakpura Road             273
Thanisandra                234
                          ...
Keerthi Layout               1
Sahyadri Layout              1
Banashankari 2 nd Stage      1
Kalkere Channasandra         1
Venkateswara Nagar           1
Name: location, Length: 1305, dtype: int64

In [47]:

df['location']=df['location'].apply(lambda x:x.strip())
location_count=df['location'].value_counts()

In [48]:
# name the location, which has less than 10 to others
location_count_less_10=location_count[location_count<=10]
location_count_less_10

Nagadevanahalli                      10
BTM 1st Stage                        10
Ganga Nagar                          10
Kalkere                              10
Sadashiva Nagar                      10
                                     ..
J.P.nagar 6th Phase.Sarakki Nagar     1
Shettihalli                           1
BDS Layout                            1
3rd Stage Raja Rajeshwari Nagar       1
MM Layout                             1
Name: location, Length: 1053, dtype: int64

In [49]:
df['location']=df['location'].apply(lambda x:'others' if x in location_count_less_10 else x)

In [50]:
df['location'].value_counts()

others                2885
Whitefield             541
Sarjapur  Road         400
Electronic City        304
Kanakpura Road         273
                      ...
Pattandur Agrahara      11
HAL 2nd Stage           11
Nehru Nagar             11
Kodigehalli             11
Narayanapura            11
Name: location, Length: 242, dtype: int64

### Remove outliers

In [51]:
df.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13073.000000  13320.000000  13320.000000  13320.000000    1.307300e+04
mean    1554.942029      2.688814    112.565627      2.802778    7.949600e+03
std     1238.458773      1.338754    148.971674      1.294496    1.072440e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.265734e+03
50%     1275.000000      2.000000     72.000000      3.000000    5.454545e+03
75%     1670.000000      3.000000    120.000000      3.000000    7.338057e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [52]:
(df['total_sqft']/df['bhk']).describe()

count    13073.000000
mean       573.254923
std        389.887823
min          0.250000
25%        472.000000
50%        551.000000
75%        625.000000
max      26136.000000
dtype: float64

In [53]:
# change the min value in total_sqft from 1 to 300.
df=df[((df['total_sqft']/df['bhk'])>=300)]
df.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  12329.000000  12329.000000  12329.000000  12329.000000    12329.000000
mean    1590.166773      2.561441    111.444236      2.651472     6322.476758
std     1261.827604      1.072551    152.759322      0.973754     4187.479096
min      300.000000      1.000000      8.440000      1.000000      267.829813
25%     1118.000000      2.000000     49.340000      2.000000     4207.119741
50%     1300.000000      2.000000     70.000000      3.000000     5300.000000
75%     1700.000000      3.000000    115.000000      3.000000     6938.483548
max    52272.000000     16.000000   3600.000000     16.000000   176470.588235

In [55]:
df.shape

(12329, 7)

In [56]:
df.price_per_sqft.describe()

count     12329.000000
mean       6322.476758
std        4187.479096
min         267.829813
25%        4207.119741
50%        5300.000000
75%        6938.483548
max      176470.588235
Name: price_per_sqft, dtype: float64

In [57]:
def remove_outlier_sqft(x):
    out_df = pd.DataFrame()
    for key, subdf in x.groupby('location'):
        mean = np.mean(subdf.price_per_sqft)
        std = np.std(subdf.price_per_sqft)
        reduced_df = subdf[(subdf.price_per_sqft > (mean - std)) & (subdf.price_per_sqft <= (mean + std))]
        out_df = pd.concat([out_df, reduced_df], ignore_index = True)
    return out_df

df = remove_outlier_sqft(df)

In [58]:
df.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  10154.000000  10154.000000  10154.000000  10154.000000    10154.000000
mean    1502.755034      2.472129     91.120414      2.573666     5670.431136
std      873.959398      0.972214     86.251507      0.893601     2276.089730
min      300.000000      1.000000     10.000000      1.000000     1250.000000
25%     1110.000000      2.000000     49.000000      2.000000     4242.424242
50%     1283.500000      2.000000     67.000000      2.000000     5184.504357
75%     1650.000000      3.000000    100.000000      3.000000     6451.612903
max    30400.000000     16.000000   2200.000000     16.000000    24509.803922

In [59]:
def remove_bhk_outliers(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean': np.mean(bhk_df.price_per_sqft),
                'std': np.std(bhk_df.price_per_sqft),
                'count': bhk_df.shape[0]
            }
        for bhk, bhk_df in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price_per_sqft<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')
df = remove_bhk_outliers(df)

In [60]:
df.describe()

         total_sqft         bath        price          bhk  price_per_sqft
count   7227.000000  7227.000000  7227.000000  7227.000000     7227.000000
mean    1494.537378     2.454684    99.211273     2.505327     6145.104545
std      858.097548     1.008949    93.330318     0.926629     2423.534379
min      300.000000     1.000000    10.000000     1.000000     1300.000000
25%     1100.000000     2.000000    50.000000     2.000000     4595.666801
50%     1260.000000     2.000000    74.000000     2.000000     5695.687551
75%     1680.000000     3.000000   114.000000     3.000000     6936.389911
max    30000.000000    16.000000  2200.000000    16.000000    24509.803922

In [62]:
df.head()

              location   size  total_sqft  bath  price  bhk  price_per_sqft
0  1st Block Jayanagar  4 BHK      2850.0   4.0  428.0    4    15017.543860
1  1st Block Jayanagar  3 BHK      1630.0   3.0  194.0    3    11901.840491
2  1st Block Jayanagar  3 BHK      1875.0   2.0  235.0    3    12533.333333
3  1st Block Jayanagar  3 BHK      1200.0   2.0  130.0    3    10833.333333
4  1st Block Jayanagar  2 BHK      1235.0   2.0  148.0    2    11983.805668

In [65]:
cleaned_data = df.drop(columns=['size','price_per_sqft'])

In [66]:
cleaned_data.head()

              location  total_sqft  bath  price  bhk
0  1st Block Jayanagar      2850.0   4.0  428.0    4
1  1st Block Jayanagar      1630.0   3.0  194.0    3
2  1st Block Jayanagar      1875.0   2.0  235.0    3
3  1st Block Jayanagar      1200.0   2.0  130.0    3
4  1st Block Jayanagar      1235.0   2.0  148.0    2

In [68]:
cleaned_data.to_csv('cleaned_data.csv')

### Build a model

In [70]:
# split data for train and test
x=cleaned_data.drop(columns=['price'])
y=cleaned_data['price']

In [72]:
y.head()

0    428.0
1    194.0
2    235.0
3    130.0
4    148.0
Name: price, dtype: float64

In [93]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import OneHotEncoder,StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [94]:
x_train,x_test,y_train,y_test=train_test_split(x,y, test_size=0.2, random_state=0)

In [95]:
print(x_train.shape)
print(x_test.shape)

(5781, 4)
(1446, 4)

### Applying Linear Regression

In [81]:
column_trans=make_column_transformer((OneHotEncoder(sparse=False),['location']), remainder='passthrough')

In [82]:
scaler=StandardScaler()

In [83]:
lr=LinearRegression(normalize=True)

In [88]:
pipe=make_pipeline(column_trans,scaler,lr)

In [89]:
pipe.fit(x_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression(normalize=True))])

In [90]:
y_predict_lr=pipe.predict(x_test)

In [92]:
r2_score(y_test,y_predict_lr)

0.8427136763786518

In [96]:
import pickle

In [97]:
pickle.dump(pipe,open('Model.pkl','wb'))